package com.zhu.oop2.homework;

/**
 * @author: ZHUXIAOKANG
 * @date: 2021/11/9 10:47
 * @description:
 */
public class Homework12 {
    //说出==和equals的区别
    /*
   |---------|---------------------|------------------------  |----------------------------------------|
   |名称     |概念                  |用于基本数据类型           |  用于引用类型                            |
   |--------|----------------------|------------------------ |----------------------------------------|
   | ==      |比较运算符            | 可以，判断值是否相等      |  可以，判断两个对象是否相等                |
   |---------|---------------------|-----------------------  |---------------------------------------- |
   | equals  |Object类的方法，Java  |   不可以                |   可以，默认是判断两个对象是否相等，       |
   |         |类都可以使用equals    |                        |   但是子类往往重写该方法，比较对象        |
   |         |                    |                         | 的属性是否相等比如（String,Integer）     |
   |----------|------------------ |-------------------------|----------------------------------------|
     */
}
